Revit 2015 API
MaterialSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public virtual MaterialSetIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As MaterialSetIterator
Visual C++
public:
virtual MaterialSetIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the set.
See Also
MaterialSet Class
Autodesk.Revit.DB Namespace